; ModuleID = 'echo.cpp'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%class.EchoTest = type { %class.Module, %class.Echo*, i32, %"class.EchoTest::drive" }
%class.Module = type { %class.Rule*, %class.Module*, i64 }
%class.Rule = type { i32 (...)**, %class.Rule* }
%class.Echo = type { %class.Module, %class.Fifo*, %class.EchoIndication*, i32, %"class.Echo::respond" }
%class.Fifo = type { i32 (...)**, %class.Module }
%class.EchoIndication = type { i8 }
%"class.Echo::respond" = type { %"class.Echo::respond::respond1", %"class.Echo::respond::respond2" }
%"class.Echo::respond::respond1" = type { %class.Rule, %class.Echo* }
%"class.Echo::respond::respond2" = type { %class.Rule, %class.Echo* }
%"class.EchoTest::drive" = type { %class.Rule, %class.EchoTest* }
%class.Fifo1 = type <{ %class.Fifo, i32, i8, [3 x i8] }>

$_ZN8EchoTestC2Ev = comdat any

$_ZN8EchoTestD2Ev = comdat any

$_ZN6ModuleC2Em = comdat any

$_ZN14EchoIndicationC2Ev = comdat any

$_ZN4EchoC2EP14EchoIndication = comdat any

$_ZN8EchoTest5driveC2EPS_ = comdat any

$_ZN5Fifo1IiEC2Ev = comdat any

$_ZN4Echo7respondC2EPS_ = comdat any

$_ZN4FifoIiEC2Em = comdat any

$_ZN5Fifo1IiED2Ev = comdat any

$_ZN5Fifo1IiED0Ev = comdat any

$_ZN5Fifo1IiE8enq__RDYEv = comdat any

$_ZN5Fifo1IiE3enqEi = comdat any

$_ZN5Fifo1IiE8deq__RDYEv = comdat any

$_ZN5Fifo1IiE3deqEv = comdat any

$_ZN5Fifo1IiE10first__RDYEv = comdat any

$_ZN5Fifo1IiE5firstEv = comdat any


!20 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 84, type: !21, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false)
!21 = !DISubroutineType(types: !22)
!22 = !{!11, !23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt15__exception_ptr13exception_ptrE")
!25 = !DISubprogram(name: "exception_ptr", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 90, type: !17, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!26 = !DISubprogram(name: "exception_ptr", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 92, type: !27, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !15, !29}
!29 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !24)
!30 = !DISubprogram(name: "exception_ptr", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 95, type: !31, isLocal: false, isDefinition: false, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !15, !33}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !7, file: !8, line: 190, baseType: !34)
!34 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!35 = !DISubprogram(name: "exception_ptr", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 99, type: !36, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !15, !38}
!38 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !"_ZTSNSt15__exception_ptr13exception_ptrE")
!39 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 112, type: !40, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !15, !29}
!42 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt15__exception_ptr13exception_ptrE")
!43 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 116, type: !44, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!42, !15, !38}
!46 = !DISubprogram(name: "~exception_ptr", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 123, type: !17, isLocal: false, isDefinition: false, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!47 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 126, type: !48, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !15, !42}
!50 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 138, type: !51, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: false)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !23}
!53 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!54 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !"_ZTSNSt15__exception_ptr13exception_ptrE", file: !5, line: 147, type: !55, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !23}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSSt9type_info")
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !7, file: !5, line: 47, flags: DIFlagFwdDecl, identifier: "_ZTSSt9type_info")
!60 = !DICompositeType(tag: DW_TAG_class_type, name: "EchoIndication", file: !1, line: 32, size: 8, align: 8, elements: !61, identifier: "_ZTS14EchoIndication")
!61 = !{!62, !66, !70}
!62 = !DISubprogram(name: "echo", linkageName: "_ZN14EchoIndication4echoEi", scope: !"_ZTS14EchoIndication", file: !1, line: 34, type: !63, isLocal: false, isDefinition: false, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65}
!65 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!66 = !DISubprogram(name: "EchoIndication", scope: !"_ZTS14EchoIndication", file: !1, line: 35, type: !67, isLocal: false, isDefinition: false, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS14EchoIndication", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!70 = !DISubprogram(name: "~EchoIndication", scope: !"_ZTS14EchoIndication", file: !1, line: 36, type: !67, isLocal: false, isDefinition: false, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "EchoTest", file: !1, line: 67, size: 512, align: 64, elements: !72, identifier: "_ZTS8EchoTest")
!72 = !{!73, !74, !76, !77, !78, !82}
!73 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS8EchoTest", baseType: !"_ZTS6Module", flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !"_ZTS8EchoTest", file: !1, line: 69, baseType: !75, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS4Echo", size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS8EchoTest", file: !1, line: 70, baseType: !65, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "driveRule", scope: !"_ZTS8EchoTest", file: !1, line: 71, baseType: !"_ZTSN8EchoTest5driveE", size: 192, align: 64, offset: 320, flags: DIFlagPublic)
!78 = !DISubprogram(name: "EchoTest", scope: !"_ZTS8EchoTest", file: !1, line: 76, type: !79, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8EchoTest", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!82 = !DISubprogram(name: "~EchoTest", scope: !"_ZTS8EchoTest", file: !1, line: 79, type: !79, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!83 = !DICompositeType(tag: DW_TAG_class_type, name: "Module", file: !84, line: 51, size: 192, align: 64, elements: !85, identifier: "_ZTS6Module")
!84 = !DIFile(filename: "../../cpp/atomicc.h", directory: "/home/jca/s/git/atomicc/examples/echo")
!85 = !{!86, !88, !90, !94, !95, !99, !102}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "rfirst", scope: !"_ZTS6Module", file: !84, line: 77, baseType: !87, size: 64, align: 64, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS4Rule", size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS6Module", file: !84, line: 78, baseType: !89, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6Module", size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS6Module", file: !84, line: 80, baseType: !91, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !92, line: 62, baseType: !93)
!92 = !DIFile(filename: "/scratch/jca/git/llvm/build/Debug+Asserts/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/jca/s/git/atomicc/examples/echo")
!93 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !"_ZTS6Module", file: !84, line: 81, baseType: !89, flags: DIFlagPublic | DIFlagStaticMember)
!95 = !DISubprogram(name: "Module", scope: !"_ZTS6Module", file: !84, line: 54, type: !96, isLocal: false, isDefinition: false, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !98, !91}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6Module", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!99 = !DISubprogram(name: "addRule", linkageName: "_ZN6Module7addRuleEP4Rule", scope: !"_ZTS6Module", file: !84, line: 61, type: !100, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !98, !87}
!102 = !DISubprogram(name: "run", linkageName: "_ZN6Module3runEv", scope: !"_ZTS6Module", file: !84, line: 66, type: !103, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !98}
!105 = !DICompositeType(tag: DW_TAG_class_type, name: "Rule", file: !84, line: 37, size: 128, align: 64, elements: !106, vtableHolder: !"_ZTS4Rule", identifier: "_ZTS4Rule")
!106 = !{!107, !112, !113, !117}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Rule", scope: !84, file: !84, baseType: !108, size: 64, flags: DIFlagArtificial)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!65}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS4Rule", file: !84, line: 41, baseType: !87, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!113 = !DISubprogram(name: "RDY", linkageName: "_ZN4Rule3RDYEv", scope: !"_ZTS4Rule", file: !84, line: 39, type: !114, isLocal: false, isDefinition: false, scopeLine: 39, containingType: !"_ZTS4Rule", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!114 = !DISubroutineType(types: !115)
!115 = !{!53, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS4Rule", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!117 = !DISubprogram(name: "ENA", linkageName: "_ZN4Rule3ENAEv", scope: !"_ZTS4Rule", file: !84, line: 40, type: !118, isLocal: false, isDefinition: false, scopeLine: 40, containingType: !"_ZTS4Rule", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !116}
!120 = !DICompositeType(tag: DW_TAG_class_type, name: "Echo", file: !1, line: 39, size: 768, align: 64, elements: !121, identifier: "_ZTS4Echo")
!121 = !{!122, !123, !125, !127, !128, !129, !133}
!122 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS4Echo", baseType: !"_ZTS6Module", flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !"_ZTS4Echo", file: !1, line: 41, baseType: !124, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS4FifoIiE", size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !"_ZTS4Echo", file: !1, line: 42, baseType: !126, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS14EchoIndication", size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pipetemp", scope: !"_ZTS4Echo", file: !1, line: 43, baseType: !65, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "respondRule", scope: !"_ZTS4Echo", file: !1, line: 44, baseType: !"_ZTSN4Echo7respondE", size: 384, align: 64, offset: 384, flags: DIFlagPublic)
!129 = !DISubprogram(name: "Echo", scope: !"_ZTS4Echo", file: !1, line: 51, type: !130, isLocal: false, isDefinition: false, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !132, !126}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS4Echo", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!133 = !DISubprogram(name: "~Echo", scope: !"_ZTS4Echo", file: !1, line: 54, type: !134, isLocal: false, isDefinition: false, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !132}
!136 = !DICompositeType(tag: DW_TAG_class_type, name: "Fifo<int>", file: !137, line: 8, size: 256, align: 64, elements: !138, vtableHolder: !"_ZTS4FifoIiE", templateParams: !166, identifier: "_ZTS4FifoIiE")
!137 = !DIFile(filename: "../../cpp/fifo.h", directory: "/home/jca/s/git/atomicc/examples/echo")
!138 = !{!139, !140, !141, !145, !148, !151, !154, !155, !156, !157, !160, !165}
!139 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS4FifoIiE", baseType: !"_ZTS6Module", offset: 64, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Fifo", scope: !137, file: !137, baseType: !108, size: 64, flags: DIFlagArtificial)
!141 = !DISubprogram(name: "Fifo", scope: !"_ZTS4FifoIiE", file: !137, line: 10, type: !142, isLocal: false, isDefinition: false, scopeLine: 10, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144, !91}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS4FifoIiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!145 = !DISubprogram(name: "~Fifo", scope: !"_ZTS4FifoIiE", file: !137, line: 11, type: !146, isLocal: false, isDefinition: false, scopeLine: 11, containingType: !"_ZTS4FifoIiE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !144}
!148 = !DISubprogram(name: "enq__RDY", linkageName: "_ZN4FifoIiE8enq__RDYEv", scope: !"_ZTS4FifoIiE", file: !137, line: 12, type: !149, isLocal: false, isDefinition: false, scopeLine: 12, containingType: !"_ZTS4FifoIiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!149 = !DISubroutineType(types: !150)
!150 = !{!53, !144}
!151 = !DISubprogram(name: "enq", linkageName: "_ZN4FifoIiE3enqEi", scope: !"_ZTS4FifoIiE", file: !137, line: 12, type: !152, isLocal: false, isDefinition: false, scopeLine: 12, containingType: !"_ZTS4FifoIiE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !144, !65}
!154 = !DISubprogram(name: "deq__RDY", linkageName: "_ZN4FifoIiE8deq__RDYEv", scope: !"_ZTS4FifoIiE", file: !137, line: 13, type: !149, isLocal: false, isDefinition: false, scopeLine: 13, containingType: !"_ZTS4FifoIiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!155 = !DISubprogram(name: "deq", linkageName: "_ZN4FifoIiE3deqEv", scope: !"_ZTS4FifoIiE", file: !137, line: 13, type: !146, isLocal: false, isDefinition: false, scopeLine: 13, containingType: !"_ZTS4FifoIiE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!156 = !DISubprogram(name: "first__RDY", linkageName: "_ZN4FifoIiE10first__RDYEv", scope: !"_ZTS4FifoIiE", file: !137, line: 14, type: !149, isLocal: false, isDefinition: false, scopeLine: 14, containingType: !"_ZTS4FifoIiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!157 = !DISubprogram(name: "first", linkageName: "_ZN4FifoIiE5firstEv", scope: !"_ZTS4FifoIiE", file: !137, line: 14, type: !158, isLocal: false, isDefinition: false, scopeLine: 14, containingType: !"_ZTS4FifoIiE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!158 = !DISubroutineType(types: !159)
!159 = !{!65, !144}
!160 = !DISubprogram(name: "notEmpty", linkageName: "_ZNK4FifoIiE8notEmptyEv", scope: !"_ZTS4FifoIiE", file: !137, line: 15, type: !161, isLocal: false, isDefinition: false, scopeLine: 15, containingType: !"_ZTS4FifoIiE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!161 = !DISubroutineType(types: !162)
!162 = !{!53, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS4FifoIiE")
!165 = !DISubprogram(name: "notFull", linkageName: "_ZNK4FifoIiE7notFullEv", scope: !"_ZTS4FifoIiE", file: !137, line: 16, type: !161, isLocal: false, isDefinition: false, scopeLine: 16, containingType: !"_ZTS4FifoIiE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!166 = !{!167}
!167 = !DITemplateTypeParameter(name: "T", type: !65)
!168 = !DICompositeType(tag: DW_TAG_class_type, name: "respond", scope: !"_ZTS4Echo", file: !1, line: 44, size: 384, align: 64, elements: !169, identifier: "_ZTSN4Echo7respondE")
!169 = !{!170, !171, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "respond1Rule", scope: !"_ZTSN4Echo7respondE", file: !1, line: 44, baseType: !"_ZTSN4Echo7respond8respond1E", size: 192, align: 64, flags: DIFlagPublic)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "respond2Rule", scope: !"_ZTSN4Echo7respondE", file: !1, line: 44, baseType: !"_ZTSN4Echo7respond8respond2E", size: 192, align: 64, offset: 192, flags: DIFlagPublic)
!172 = !DISubprogram(name: "respond", scope: !"_ZTSN4Echo7respondE", file: !1, line: 44, type: !173, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !175, !75}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN4Echo7respondE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!176 = !DICompositeType(tag: DW_TAG_class_type, name: "respond1", scope: !"_ZTSN4Echo7respondE", file: !1, line: 44, size: 192, align: 64, elements: !177, vtableHolder: !"_ZTS4Rule", identifier: "_ZTSN4Echo7respond8respond1E")
!177 = !{!178, !179, !180, !184, !187}
!178 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN4Echo7respond8respond1E", baseType: !"_ZTS4Rule", flags: DIFlagPublic)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !"_ZTSN4Echo7respond8respond1E", file: !1, line: 44, baseType: !75, size: 64, align: 64, offset: 128)
!180 = !DISubprogram(name: "RDY", linkageName: "_ZN4Echo7respond8respond13RDYEv", scope: !"_ZTSN4Echo7respond8respond1E", file: !1, line: 44, type: !181, isLocal: false, isDefinition: false, scopeLine: 44, containingType: !"_ZTSN4Echo7respond8respond1E", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!181 = !DISubroutineType(types: !182)
!182 = !{!53, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN4Echo7respond8respond1E", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!184 = !DISubprogram(name: "ENA", linkageName: "_ZN4Echo7respond8respond13ENAEv", scope: !"_ZTSN4Echo7respond8respond1E", file: !1, line: 44, type: !185, isLocal: false, isDefinition: false, scopeLine: 44, containingType: !"_ZTSN4Echo7respond8respond1E", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !183}
!187 = !DISubprogram(name: "respond1", scope: !"_ZTSN4Echo7respond8respond1E", file: !1, line: 44, type: !188, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !183, !75}
!190 = !DICompositeType(tag: DW_TAG_class_type, name: "respond2", scope: !"_ZTSN4Echo7respondE", file: !1, line: 44, size: 192, align: 64, elements: !191, vtableHolder: !"_ZTS4Rule", identifier: "_ZTSN4Echo7respond8respond2E")
!191 = !{!192, !193, !194, !198, !201}
!192 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN4Echo7respond8respond2E", baseType: !"_ZTS4Rule", flags: DIFlagPublic)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !"_ZTSN4Echo7respond8respond2E", file: !1, line: 44, baseType: !75, size: 64, align: 64, offset: 128)
!194 = !DISubprogram(name: "RDY", linkageName: "_ZN4Echo7respond8respond23RDYEv", scope: !"_ZTSN4Echo7respond8respond2E", file: !1, line: 44, type: !195, isLocal: false, isDefinition: false, scopeLine: 44, containingType: !"_ZTSN4Echo7respond8respond2E", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!195 = !DISubroutineType(types: !196)
!196 = !{!53, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN4Echo7respond8respond2E", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!198 = !DISubprogram(name: "ENA", linkageName: "_ZN4Echo7respond8respond23ENAEv", scope: !"_ZTSN4Echo7respond8respond2E", file: !1, line: 44, type: !199, isLocal: false, isDefinition: false, scopeLine: 44, containingType: !"_ZTSN4Echo7respond8respond2E", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !197}
!201 = !DISubprogram(name: "respond2", scope: !"_ZTSN4Echo7respond8respond2E", file: !1, line: 44, type: !202, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !197, !75}
!204 = !DICompositeType(tag: DW_TAG_class_type, name: "drive", scope: !"_ZTS8EchoTest", file: !1, line: 71, size: 192, align: 64, elements: !205, vtableHolder: !"_ZTS4Rule", identifier: "_ZTSN8EchoTest5driveE")
!205 = !{!206, !207, !209, !213, !216}
!206 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8EchoTest5driveE", baseType: !"_ZTS4Rule", flags: DIFlagPublic)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !"_ZTSN8EchoTest5driveE", file: !1, line: 71, baseType: !208, size: 64, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8EchoTest", size: 64, align: 64)
!209 = !DISubprogram(name: "RDY", linkageName: "_ZN8EchoTest5drive3RDYEv", scope: !"_ZTSN8EchoTest5driveE", file: !1, line: 71, type: !210, isLocal: false, isDefinition: false, scopeLine: 71, containingType: !"_ZTSN8EchoTest5driveE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!210 = !DISubroutineType(types: !211)
!211 = !{!53, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8EchoTest5driveE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!213 = !DISubprogram(name: "ENA", linkageName: "_ZN8EchoTest5drive3ENAEv", scope: !"_ZTSN8EchoTest5driveE", file: !1, line: 71, type: !214, isLocal: false, isDefinition: false, scopeLine: 71, containingType: !"_ZTSN8EchoTest5driveE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !212}
!216 = !DISubprogram(name: "drive", scope: !"_ZTSN8EchoTest5driveE", file: !1, line: 71, type: !217, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !212, !208}
!219 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!220 = !DICompositeType(tag: DW_TAG_class_type, name: "Fifo1<int>", file: !137, line: 20, size: 320, align: 64, elements: !221, vtableHolder: !"_ZTS4FifoIiE", templateParams: !166, identifier: "_ZTS5Fifo1IiE")
!221 = !{!222, !223, !224, !225, !229, !232, !233, !236, !237, !240, !241, !242, !247}
!222 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS5Fifo1IiE", baseType: !"_ZTS4FifoIiE", flags: DIFlagPublic)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !"_ZTS5Fifo1IiE", file: !137, line: 23, baseType: !65, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !"_ZTS5Fifo1IiE", file: !137, line: 24, baseType: !53, size: 8, align: 8, offset: 288, flags: DIFlagPublic)
!225 = !DISubprogram(name: "enq__RDY", linkageName: "_ZN5Fifo1IiE8enq__RDYEv", scope: !"_ZTS5Fifo1IiE", file: !137, line: 26, type: !226, isLocal: false, isDefinition: false, scopeLine: 26, containingType: !"_ZTS5Fifo1IiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!226 = !DISubroutineType(types: !227)
!227 = !{!53, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS5Fifo1IiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!229 = !DISubprogram(name: "enq", linkageName: "_ZN5Fifo1IiE3enqEi", scope: !"_ZTS5Fifo1IiE", file: !137, line: 26, type: !230, isLocal: false, isDefinition: false, scopeLine: 26, containingType: !"_ZTS5Fifo1IiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !228, !65}
!232 = !DISubprogram(name: "deq__RDY", linkageName: "_ZN5Fifo1IiE8deq__RDYEv", scope: !"_ZTS5Fifo1IiE", file: !137, line: 30, type: !226, isLocal: false, isDefinition: false, scopeLine: 30, containingType: !"_ZTS5Fifo1IiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!233 = !DISubprogram(name: "deq", linkageName: "_ZN5Fifo1IiE3deqEv", scope: !"_ZTS5Fifo1IiE", file: !137, line: 30, type: !234, isLocal: false, isDefinition: false, scopeLine: 30, containingType: !"_ZTS5Fifo1IiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !228}
!236 = !DISubprogram(name: "first__RDY", linkageName: "_ZN5Fifo1IiE10first__RDYEv", scope: !"_ZTS5Fifo1IiE", file: !137, line: 33, type: !226, isLocal: false, isDefinition: false, scopeLine: 33, containingType: !"_ZTS5Fifo1IiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!237 = !DISubprogram(name: "first", linkageName: "_ZN5Fifo1IiE5firstEv", scope: !"_ZTS5Fifo1IiE", file: !137, line: 33, type: !238, isLocal: false, isDefinition: false, scopeLine: 33, containingType: !"_ZTS5Fifo1IiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!238 = !DISubroutineType(types: !239)
!239 = !{!65, !228}
!240 = !DISubprogram(name: "Fifo1", scope: !"_ZTS5Fifo1IiE", file: !137, line: 36, type: !234, isLocal: false, isDefinition: false, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!241 = !DISubprogram(name: "~Fifo1", scope: !"_ZTS5Fifo1IiE", file: !137, line: 40, type: !234, isLocal: false, isDefinition: false, scopeLine: 40, containingType: !"_ZTS5Fifo1IiE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!242 = !DISubprogram(name: "notEmpty", linkageName: "_ZNK5Fifo1IiE8notEmptyEv", scope: !"_ZTS5Fifo1IiE", file: !137, line: 41, type: !243, isLocal: false, isDefinition: false, scopeLine: 41, containingType: !"_ZTS5Fifo1IiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!243 = !DISubroutineType(types: !244)
!244 = !{!53, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS5Fifo1IiE")
!247 = !DISubprogram(name: "notFull", linkageName: "_ZNK5Fifo1IiE7notFullEv", scope: !"_ZTS5Fifo1IiE", file: !137, line: 42, type: !243, isLocal: false, isDefinition: false, scopeLine: 42, containingType: !"_ZTS5Fifo1IiE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
